
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    тДерево = РеквизитФормыВЗначение("Дерево");
 
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	СтруктураОрганизации.Ссылка КАК Реквизит2,
                  |	СтруктураОрганизацииСрезПоследних.Родитель КАК Реквизит1
                  |ИЗ
                  |	Справочник.СтруктураОрганизации КАК СтруктураОрганизации 
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураОрганизации.СрезПоследних КАК СтруктураОрганизацииСрезПоследних
                  |		ПО СтруктураОрганизацииСрезПоследних.Элемент = СтруктураОрганизации.Ссылка";
   Выгрузка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
 
   тДерево = Выгрузка;
 
   ЗначениеВРеквизитФормы(тДерево, "Дерево");
КонецПроцедуры
